#+title: Emacs Macros
#+hugo_base_dir: ../../
#+hugo_section: ./post
#+Date: <2020-02-23 Sat>
#+hugo_auto_set_lastmod: t
#+hugo_weight: auto
#+hugo_tags: emacs macro
#+hugo_categories: emacs elisp

Macro允许你定义新的控制结构和其他的语言功能。

Macro的定义很像函数。我们调用的这个Macro扩展的表达式,解释了如何去计算其
他的Lisp表达式，从而进一步计算值。而不是解释如何去计算一个值。

<!--more-->

Macro之所以可以这样做，因为他们对参数的上的未评估的表达式进行运算。而
不是像函数那样对参数值进行运算。因此它们可以构建一个包含这些参数表达式
或者它一部分的扩展。

如果你使用一个 Macro 做一个普通函数可以做的一些事情,只是为了速度，可以
考虑使用一下 [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Inline-Functions.html#Inline-Functions][Inline function]]。

- [[*Simple Macro][Simple Macro]]: A basic example。
- [[*Expansion of a Macro Call][Expansion of a Macro Call]]: How,When and why macros are expanded.
- [[*Compiling Macros][Compiling Macros]]: How macros are expanded by the compiler.
- [[*Defining Macros][Defining Macros]]:  How to write a macro definition.
- [[*Common Problems Using Macros][Common Problems Using Macros]]: Don't evaluate the macro arguments too
  many times.Don't hide the user's variables.


*** Argument Evaluation
    *Evaluating Macro Arguments Repeatedly*
    
    When defining a macro you *must* pay attention to the number of
    times the arguments will be evaluated when the expansion is
    executed. 
    
    The following macro (used to facilitate iteration) illustrates the
    problem. This macro allows us to write a for-loop construct.
    
    
    *org mode* 的 ~results~ 关键字一定要设置好选项，不然不起作用的。贼j2难受。
    
    - /output/ 是程序执行过程中的值。
    - /code/ 是程序执行的最终值。
    
    #+name: build_while_loop
    #+begin_src emacs-lisp :results output :exports result
      (defun build_while_loop (init final)
	    (let ((i init))
	      (while (< i final)
		(progn
		  (print ( format "%s" i))
		  (setq i (1+ i))
		  (print (format "%s" "我在循环体内"))))))

      (format "%S" (build_while_loop 1 11))
    #+end_src

    #+RESULTS: build_while_loop
    #+begin_example

    "1"

    "我在循环体内"

    "2"

    "我在循环体内"

    "3"

    "我在循环体内"

    "4"

    "我在循环体内"

    "5"

    "我在循环体内"

    "6"

    "我在循环体内"

    "7"

    "我在循环体内"

    "8"

    "我在循环体内"

    "9"

    "我在循环体内"

    "10"

    "我在循环体内"
    #+end_example

    现在我们想将上面这个函数改造成宏的写法。来测试一下，看管用不管用。
    
    #+begin_src emacs-lisp
    #+end_src
    
